In [1]:
import pandas as pd

In [6]:
data = [(1, 2, 3, 4), (5, 6, 7, 8), (9, 10, 11, 12), (13, 14, 15, 16)]
df = pd.DataFrame(data = data, index = '11 12 13 14'.split(), columns = 'c1 c2 c3 c4'.split())
# o split() cria uma lista com os valores informados

In [7]:
df

    c1  c2  c3  c4
11   1   2   3   4
12   5   6   7   8
13   9  10  11  12
14  13  14  15  16

In [8]:
df['c1']

11     1
12     5
13     9
14    13
Name: c1, dtype: int64

In [9]:
type(df['c1'])

pandas.core.series.Series

In [10]:
df[['c3', 'c1']]

    c3  c1
11   3   1
12   7   5
13  11   9
14  15  13

In [11]:
type(df[['c3', 'c1']])

pandas.core.frame.DataFrame

In [12]:
df[:]

    c1  c2  c3  c4
11   1   2   3   4
12   5   6   7   8
13   9  10  11  12
14  13  14  15  16

In [13]:
df[1:]

    c1  c2  c3  c4
12   5   6   7   8
13   9  10  11  12
14  13  14  15  16

In [14]:
df[1:3] # o slice não inclui o último indice informado e sim o i - 1

    c1  c2  c3  c4
12   5   6   7   8
13   9  10  11  12

In [15]:
df[1:][['c3', 'c1']]

    c3  c1
12   7   5
13  11   9
14  15  13

In [16]:
df.loc['13'] # .loc cria uma Series com os valores do rótulo indicado

c1     9
c2    10
c3    11
c4    12
Name: 13, dtype: int64

In [17]:
df.loc[['13', '12']]

    c1  c2  c3  c4
13   9  10  11  12
12   5   6   7   8

In [18]:
df.loc['11', 'c2'] # também pode ser usado para retornar um valor informando o rótulo da linha e a coluna desse valor

2

In [19]:
df.iloc[0, 1] # o .iloc também retorna os mesmos valores do .loc, a diferença é que usa o índice numérico e não o rótulo

2

In [20]:
df.loc[['13','11'], ['c4', 'c1']]

    c4  c1
13  12   9
11   4   1

In [21]:
df.iloc[[2, 0], [3, 0]]

    c4  c1
13  12   9
11   4   1